Autodesk.Revit.DB.UnitSystem
Since:
2014
A system of measurement: Metric or Imperial units.
Since:
2014

Autodesk.Revit.DB.UnitSystem.Imperial
Imperial units.

Autodesk.Revit.DB.UnitSystem.Metric
Metric units.